## handling - mixed - variables

In [122]:
import numpy as np 
import pandas as pd

In [123]:
df=pd.read_csv('titanic.csv')

In [124]:
df.head()

  Cabin            Ticket number  Survived
0   NaN         A/5 21171      5         0
1   C85          PC 17599      3         1
2   NaN  STON/O2. 3101282      6         1
3  C123            113803      3         1
4   NaN            373450      A         0

In [125]:
df.isnull().sum()

Cabin       687
Ticket        0
number        0
Survived      0
dtype: int64

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Cabin     204 non-null    object
 1   Ticket    891 non-null    object
 2   number    891 non-null    object
 3   Survived  891 non-null    int64
dtypes: int64(1), object(3)
memory usage: 28.0+ KB

In [127]:
df.sample(5)

       Cabin  Ticket number  Survived
359      NaN  330980      6         1
297  C22 C26  113781      5         0
112      NaN  324669      6         0
412      C78   19928      2         1
146      NaN  350043      3         1

In [128]:
df['number'].unique()

array(['5', '3', '6', 'A', '2', '1', '4'], dtype=object)

In [129]:
df['number_numeric']=pd.to_numeric(df['number'],errors='coerce',downcast='integer')

In [130]:
df['number_categorical']=np.where(df['number_numeric'].isnull(),df['number'],np.nan)

In [131]:
df.head()

  Cabin            Ticket number  Survived  number_numeric number_categorical
0   NaN         A/5 21171      5         0             5.0                NaN
1   C85          PC 17599      3         1             3.0                NaN
2   NaN  STON/O2. 3101282      6         1             6.0                NaN
3  C123            113803      3         1             3.0                NaN
4   NaN            373450      A         0             NaN                  A

In [132]:
df['ticket_numeric']=df['Ticket'].apply(lambda s: s.split()[-1])
df['ticket_numeric']=pd.to_numeric(df['ticket_numeric'], errors='coerce', downcast='integer')

In [133]:
df['ticket_categorical']=df['Ticket'].apply(lambda s: s.split()[0])
df['ticket_categorical']=np.where(df['ticket_categorical'].str.isdigit(),np.nan, df['ticket_categorical'])

In [134]:
df.head()

,Cabin,Ticket,number,Survived,number_numeric,number_categorical,ticket_numeric,ticket_categorical
0,NaN,A/5 21171,5,0,5.0,NaN,21171.0,A/5
1,C85,PC 17599,3,1,3.0,NaN,17599.0,PC
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,3101282.0,STON/O2.
3,C123,113803,3,1,3.0,NaN,113803.0,NaN
4,NaN,373450,A,0,NaN,A,373450.0,NaN

In [136]:
df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [138]:
df['cabin_numeric']=df['Cabin'].str.extract('(\d+)')
df['cabin_categorical']=df['Cabin'].str[0]

In [139]:
df.head()

,Cabin,Ticket,number,Survived,number_numeric,number_categorical,ticket_numeric,ticket_categorical,cabin_numeric,cabin_categorical
0,NaN,A/5 21171,5,0,5.0,NaN,21171.0,A/5,NaN,NaN
1,C85,PC 17599,3,1,3.0,NaN,17599.0,PC,85,C
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,3101282.0,STON/O2.,NaN,NaN
3,C123,113803,3,1,3.0,NaN,113803.0,NaN,123,C
4,NaN,373450,A,0,NaN,A,373450.0,NaN,NaN,NaN